<details><summary>Digger run report at 2024-08-05 11:57:12 (UTC)</summary>
                <details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_argo</b></summary>
  
```terraform
Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.3.11"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "configs.params.server.insecure"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "configs.secret.argocdServerAdminPassword"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "server.ingress.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "server.ingress.ingressClassName"
          + value = "nginx"
            # (1 unchanged attribute hidden)
        }
    }

  # htpasswd_password.hash will be created
  + resource "htpasswd_password" "hash" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # kubernetes_ingress_v1.this[0] will be created
  + resource "kubernetes_ingress_v1" "this" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "ingress.kubernetes.io/ssl-redirect"             = "true"
              + "kubernetes.io/ingress.class"                    = "nginx"
              + "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTPS"
              + "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
            }
          + generation       = (known after apply)
          + name             = "argocd-server-http-ingress"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = (known after apply)

          + rule {
              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "argocd-server"

                              + port {
                                  + name = "http"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace_v1.floorball_fantasy_namespace[0] will be created
  + resource "kubernetes_namespace_v1" "floorball_fantasy_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "floorball-fantasy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

  ```
</details>

<details><summary>Terraform plan validation check (staging_argo)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_cluster has been locked by PR #12
</details>


→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_cluster


<details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_kubernetes-addons has been locked by PR #12
</details>


→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_kubernetes-addons


<details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_vpc has been locked by PR #12
</details>


→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_vpc

</details>